.emacs.d/configs/dashboard.org
#+TITLE: Emacs Dashboard
#+AUTHOR: Zahin Muhaimeen
#+DESCRIPTION: Configuring the dashboard in emacs

** Installing and Configuring Dashboard
I had a pretty nifty dashboard configuration in my neovim config, so I tried something similar. This still needs some work but it is what it is. I have to add more packages to add stuff like project management but I will get to it later.

#+begin_src elisp
(use-package dashboard
    :ensure t
    :init
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-footer-icon (all-the-icons-fileicon "elisp"
                                                       :height 1.1
                                                       :v-adjust -0.05
                                                       :face 'all-the-icons-blue))
    (setq dashboard-startup-banner "~/.emacs.d/images/emacs-dash.png")
    (setq dashboard-center-content t)
    (setq dashboard-items '((recents . 5)
                            (agenda . 5)
                            (bookmarks . 3)))
                            ;; (projects . 3)
                            ;; (registers . 3)))
    :config
    (dashboard-setup-startup-hook))
    (dashboard-modify-heading-icons '((recents . "file-text")
                                      (bookmarks . "book")))
#+end_src

*** Startup with Dashboard
When I am not opening a file with emacs, display dashboard.

#+begin_src elisp
(setq initial-buffer-choice (lambda () (dashboard-refresh-buffer)))
#+end_src
